zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K341_SIUL2.h
#define SIUL2_IFER0_IFE14_MASK                   (0x4000U)
#define SIUL2_IFER0_IFE14_SHIFT                  (14U)
#define SIUL2_IFER0_IFE14_WIDTH                  (1U)
#define SIUL2_IFER0_IFE14(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE14_SHIFT)) & SIUL2_IFER0_IFE14_MASK)

#define SIUL2_IFER0_IFE15_MASK                   (0x8000U)
#define SIUL2_IFER0_IFE15_SHIFT                  (15U)
#define SIUL2_IFER0_IFE15_WIDTH                  (1U)
#define SIUL2_IFER0_IFE15(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE15_SHIFT)) & SIUL2_IFER0_IFE15_MASK)

#define SIUL2_IFER0_IFE16_MASK                   (0x10000U)
#define SIUL2_IFER0_IFE16_SHIFT                  (16U)
#define SIUL2_IFER0_IFE16_WIDTH                  (1U)
#define SIUL2_IFER0_IFE16(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE16_SHIFT)) & SIUL2_IFER0_IFE16_MASK)

#define SIUL2_IFER0_IFE17_MASK                   (0x20000U)
#define SIUL2_IFER0_IFE17_SHIFT                  (17U)
#define SIUL2_IFER0_IFE17_WIDTH                  (1U)
#define SIUL2_IFER0_IFE17(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE17_SHIFT)) & SIUL2_IFER0_IFE17_MASK)

#define SIUL2_IFER0_IFE18_MASK                   (0x40000U)
#define SIUL2_IFER0_IFE18_SHIFT                  (18U)
#define SIUL2_IFER0_IFE18_WIDTH                  (1U)
#define SIUL2_IFER0_IFE18(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE18_SHIFT)) & SIUL2_IFER0_IFE18_MASK)

#define SIUL2_IFER0_IFE19_MASK                   (0x80000U)
#define SIUL2_IFER0_IFE19_SHIFT                  (19U)
#define SIUL2_IFER0_IFE19_WIDTH                  (1U)
#define SIUL2_IFER0_IFE19(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE19_SHIFT)) & SIUL2_IFER0_IFE19_MASK)

#define SIUL2_IFER0_IFE20_MASK                   (0x100000U)
#define SIUL2_IFER0_IFE20_SHIFT                  (20U)
#define SIUL2_IFER0_IFE20_WIDTH                  (1U)
#define SIUL2_IFER0_IFE20(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE20_SHIFT)) & SIUL2_IFER0_IFE20_MASK)

#define SIUL2_IFER0_IFE21_MASK                   (0x200000U)
#define SIUL2_IFER0_IFE21_SHIFT                  (21U)
#define SIUL2_IFER0_IFE21_WIDTH                  (1U)
#define SIUL2_IFER0_IFE21(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE21_SHIFT)) & SIUL2_IFER0_IFE21_MASK)

#define SIUL2_IFER0_IFE22_MASK                   (0x400000U)
#define SIUL2_IFER0_IFE22_SHIFT                  (22U)
#define SIUL2_IFER0_IFE22_WIDTH                  (1U)
#define SIUL2_IFER0_IFE22(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE22_SHIFT)) & SIUL2_IFER0_IFE22_MASK)

#define SIUL2_IFER0_IFE23_MASK                   (0x800000U)
#define SIUL2_IFER0_IFE23_SHIFT                  (23U)
#define SIUL2_IFER0_IFE23_WIDTH                  (1U)
#define SIUL2_IFER0_IFE23(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE23_SHIFT)) & SIUL2_IFER0_IFE23_MASK)

#define SIUL2_IFER0_IFE24_MASK                   (0x1000000U)
#define SIUL2_IFER0_IFE24_SHIFT                  (24U)
#define SIUL2_IFER0_IFE24_WIDTH                  (1U)
#define SIUL2_IFER0_IFE24(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE24_SHIFT)) & SIUL2_IFER0_IFE24_MASK)

#define SIUL2_IFER0_IFE25_MASK                   (0x2000000U)
#define SIUL2_IFER0_IFE25_SHIFT                  (25U)
#define SIUL2_IFER0_IFE25_WIDTH                  (1U)
#define SIUL2_IFER0_IFE25(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE25_SHIFT)) & SIUL2_IFER0_IFE25_MASK)

#define SIUL2_IFER0_IFE26_MASK                   (0x4000000U)
#define SIUL2_IFER0_IFE26_SHIFT                  (26U)
#define SIUL2_IFER0_IFE26_WIDTH                  (1U)
#define SIUL2_IFER0_IFE26(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE26_SHIFT)) & SIUL2_IFER0_IFE26_MASK)

#define SIUL2_IFER0_IFE27_MASK                   (0x8000000U)
#define SIUL2_IFER0_IFE27_SHIFT                  (27U)
#define SIUL2_IFER0_IFE27_WIDTH                  (1U)
#define SIUL2_IFER0_IFE27(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE27_SHIFT)) & SIUL2_IFER0_IFE27_MASK)

#define SIUL2_IFER0_IFE28_MASK                   (0x10000000U)
#define SIUL2_IFER0_IFE28_SHIFT                  (28U)
#define SIUL2_IFER0_IFE28_WIDTH                  (1U)
#define SIUL2_IFER0_IFE28(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE28_SHIFT)) & SIUL2_IFER0_IFE28_MASK)

#define SIUL2_IFER0_IFE29_MASK                   (0x20000000U)
#define SIUL2_IFER0_IFE29_SHIFT                  (29U)
#define SIUL2_IFER0_IFE29_WIDTH                  (1U)
#define SIUL2_IFER0_IFE29(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE29_SHIFT)) & SIUL2_IFER0_IFE29_MASK)

#define SIUL2_IFER0_IFE30_MASK                   (0x40000000U)
#define SIUL2_IFER0_IFE30_SHIFT                  (30U)
#define SIUL2_IFER0_IFE30_WIDTH                  (1U)
#define SIUL2_IFER0_IFE30(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE30_SHIFT)) & SIUL2_IFER0_IFE30_MASK)

#define SIUL2_IFER0_IFE31_MASK                   (0x80000000U)
#define SIUL2_IFER0_IFE31_SHIFT                  (31U)
#define SIUL2_IFER0_IFE31_WIDTH                  (1U)
#define SIUL2_IFER0_IFE31(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_IFER0_IFE31_SHIFT)) & SIUL2_IFER0_IFE31_MASK)
/*! @} */

/*! @name IFMCR - SIUL2 Interrupt Filter Maximum Counter */
/*! @{ */

#define SIUL2_IFMCR_MAXCNT_MASK                  (0xFU)
#define SIUL2_IFMCR_MAXCNT_SHIFT                 (0U)
#define SIUL2_IFMCR_MAXCNT_WIDTH                 (4U)
#define SIUL2_IFMCR_MAXCNT(x)                    (((uint32_t)(((uint32_t)(x)) << SIUL2_IFMCR_MAXCNT_SHIFT)) & SIUL2_IFMCR_MAXCNT_MASK)
/*! @} */

/*! @name IFCPR - SIUL2 Interrupt Filter Clock Prescaler */
/*! @{ */

#define SIUL2_IFCPR_IFCP_MASK                    (0xFU)
#define SIUL2_IFCPR_IFCP_SHIFT                   (0U)
#define SIUL2_IFCPR_IFCP_WIDTH                   (4U)
#define SIUL2_IFCPR_IFCP(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_IFCPR_IFCP_SHIFT)) & SIUL2_IFCPR_IFCP_MASK)
/*! @} */

/*! @name UDR1 - SIUL2 User Defined */
/*! @{ */

#define SIUL2_UDR1_UDR0_MASK                     (0x1U)
#define SIUL2_UDR1_UDR0_SHIFT                    (0U)
#define SIUL2_UDR1_UDR0_WIDTH                    (1U)
#define SIUL2_UDR1_UDR0(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR0_SHIFT)) & SIUL2_UDR1_UDR0_MASK)

#define SIUL2_UDR1_UDR1_MASK                     (0x2U)
#define SIUL2_UDR1_UDR1_SHIFT                    (1U)
#define SIUL2_UDR1_UDR1_WIDTH                    (1U)
#define SIUL2_UDR1_UDR1(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR1_SHIFT)) & SIUL2_UDR1_UDR1_MASK)

#define SIUL2_UDR1_UDR2_MASK                     (0x4U)
#define SIUL2_UDR1_UDR2_SHIFT                    (2U)
#define SIUL2_UDR1_UDR2_WIDTH                    (1U)
#define SIUL2_UDR1_UDR2(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR2_SHIFT)) & SIUL2_UDR1_UDR2_MASK)

#define SIUL2_UDR1_UDR3_MASK                     (0x8U)
#define SIUL2_UDR1_UDR3_SHIFT                    (3U)
#define SIUL2_UDR1_UDR3_WIDTH                    (1U)
#define SIUL2_UDR1_UDR3(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR3_SHIFT)) & SIUL2_UDR1_UDR3_MASK)

#define SIUL2_UDR1_UDR4_MASK                     (0x10U)
#define SIUL2_UDR1_UDR4_SHIFT                    (4U)
#define SIUL2_UDR1_UDR4_WIDTH                    (1U)
#define SIUL2_UDR1_UDR4(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR4_SHIFT)) & SIUL2_UDR1_UDR4_MASK)

#define SIUL2_UDR1_UDR5_MASK                     (0x20U)
#define SIUL2_UDR1_UDR5_SHIFT                    (5U)
#define SIUL2_UDR1_UDR5_WIDTH                    (1U)
#define SIUL2_UDR1_UDR5(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR5_SHIFT)) & SIUL2_UDR1_UDR5_MASK)

#define SIUL2_UDR1_UDR6_MASK                     (0x40U)
#define SIUL2_UDR1_UDR6_SHIFT                    (6U)
#define SIUL2_UDR1_UDR6_WIDTH                    (1U)
#define SIUL2_UDR1_UDR6(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR6_SHIFT)) & SIUL2_UDR1_UDR6_MASK)

#define SIUL2_UDR1_UDR7_MASK                     (0x80U)
#define SIUL2_UDR1_UDR7_SHIFT                    (7U)
#define SIUL2_UDR1_UDR7_WIDTH                    (1U)
#define SIUL2_UDR1_UDR7(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR7_SHIFT)) & SIUL2_UDR1_UDR7_MASK)

#define SIUL2_UDR1_UDR8_MASK                     (0x100U)
#define SIUL2_UDR1_UDR8_SHIFT                    (8U)
#define SIUL2_UDR1_UDR8_WIDTH                    (1U)
#define SIUL2_UDR1_UDR8(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR8_SHIFT)) & SIUL2_UDR1_UDR8_MASK)

#define SIUL2_UDR1_UDR9_MASK                     (0x200U)
#define SIUL2_UDR1_UDR9_SHIFT                    (9U)
#define SIUL2_UDR1_UDR9_WIDTH                    (1U)
#define SIUL2_UDR1_UDR9(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR9_SHIFT)) & SIUL2_UDR1_UDR9_MASK)

